// const db = require("../db");

require("dotenv").config();

const { Pool } = require("pg");

const db = new Pool({
  connectionString: "postgresql://mohamed:moh01234@localhost:5432/jsc",
});

const PRIVATE = [
  "مركز بيوتي دير البلح",
  "مركز بيوتي غزة",
  "مركز بيوتي رفح",
  "م. الكويتي",
  "بنك الدم",
  "مركز العودة النصيرات",
  "مركز العودة رفح",
  "مركز العودة بني سهيلا",
  "م. دار السلام",
  "مركز صحة المرأة",
  "مركز الرازي",
  "مختبر فراس",
  "مركز نبض الحياة",
  "مركز النبيل",
  "السلفيه",
  "أرض الانسان",
  "مختبر ابو الوليد",
  "اتحاد الكنائس",
  "مختبر شحيبر",
  "عيادة د.محمود خالد خطاب",
  "المركز الألماني",
  "مركز قرة عين",
  "مختبر نسيمة",
  "م. الأمل",
  "مختبر النور",
  "جمعية اسناد",
  "مختبر اكيوميد",
  "عيادة الهدى",
  "م. الخير",
  "مختبر بن حيان",
  "مختبر رعاية الأسرة",
  "عيادة الأقصى",
  "مختبر بارود",
  "مركز المستقبل",
  "مختبر ناجي الحولي",
  "عيادة د. اشرف اعمر",
  "مختبر حمادة",
  "مختبر سعد",
  "مختبر بلسم خانيونس",
  "م. رفح التخصصي للأسنان",
  "مختبر العودة الطبي",
  "مختبر بلسم النصيرات",
  "مختبر النسمة للأسنان",
  "مختبر دلتا",
  "صيدلية طيبة",
  "مركز الحلبي الطبي",
  "مختبر الفاروق",
  "عيادة د. رأفت صبح",
  "مركز امان الطبي",
  "الاندونيسي الميداني",
  "م. يافا",
  "ميرسي ماليزيا",
  "سلفر دية",
  "شركة بيلا فيستا",
  "المستشفى الأردني الميداني",
  "عيادة غليا",
  "شركة القلاع",
];

// Adding all PRIVATE partner names

async function seed() {
  for (let i = 0; i < PRIVATE.length; i++) {
    await db.query(
      `INSERT INTO partner_names (partner_type, name) VALUES ($1, $2)`,
      ["عيادات خاصة", PRIVATE[i]]
    );
  }
  console.log("DATABASE SEEDED!");
}

seed();
